# GetClUseTextStyle

## Description
Function GetClUseTextStyle returns whether the text style of the specified class is used at object creation.

```pascal
FUNCTION GetClUseTextStyle(className : STRING): BOOLEAN;
```

```python
def vs.GetClUseTextStyle(className):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Name of class|

## Examples
```pascal
resultOK := GetClUseTextStyle('Wall');
```
```python
import vs

# Function GetClUseTextStyle returns whether the text style of the specified
# class is used at object creation.
className = 'None'

ok = vs.GetClUseTextStyle(className)
if ok:
    vs.Message('GetClUseTextStyle succeeded')
else:
    vs.Message('GetClUseTextStyle failed')
```

## See Also
VS Functions:
SetClUseTextStyle
| SetClTextStyleRef
| GetClTextStyleRef

## Version
Availability: from Vectorworks 2015

## Category
* Classes